export const fetters = [{
        label: "恶魔",
        en: "em",
        level: [
            "2/4/6个恶魔",
            "恶魔的攻击有20/35/60%几率灼烧一名敌人的所有法力值并造成300%的伤害"
        ]
    },
    { label: "龙", en: "long", level: ["2个龙", "龙免疫83%魔法伤害"] },
    {
        label: "浪人",
        en: "liuwang",
        level: [
            "1个浪人",
            "战斗开始时，如果一名浪人的邻近格子没有友军，获得一层等同于自身最大生命值的护盾"
        ]
    },
    {
        label: "极地",
        en: "binghe",
        level: [
            "2/4/6个极地",
            "极地生物们的攻击有20/30/45%几率对目标造成持续2秒的晕眩效果"
        ]
    },
    {
        label: "帝国",
        en: "diguo",
        level: ["2/4个帝国", "1名随机/所有的帝国单位造成双倍伤害"]
    },
    {
        label: "忍者",
        en: "renzhe",
        level: ["1/4个忍者", "提高忍者40/60攻击力和法术强度"]
    },
    {
        label: "贵族",
        en: "gaogui",
        level: [
            "3/6个贵族",
            "增加1个随机/所有友军60护甲和魔抗并且每次攻击治疗该友军35点生命值"
        ]
    },
    {
        label: "暗影",
        en: "huanying",
        level: ["2个暗影", "在战斗开始时诅咒一名随机的敌人，将其生命值设置为100"]
    },
    {
        label: "海盗",
        en: "haidao",
        level: [
            "3个海盗",
            "在与另一名玩家作战之后，最多可赚取4枚额外的金币。（每个箱子的平均金币：1.75）"
        ]
    },
    {
        label: "机器人",
        en: "jiqiren",
        level: ["1个机器人", "机器人在开始战斗时就有满额的法力值"]
    },
    {
        label: "虚空",
        en: "kongxu",
        level: ["3个虚空", "虚空单位现在造成真实伤害"]
    },
    {
        label: "狂野",
        en: "yeshen",
        level: [
            "2/4个狂野",
            "野性友军/所有友军的攻击会生成怒气层数，最多5层，每层怒气提供10%的攻击速度加成"
        ]
    },
    {
        label: "约德尔人",
        en: "yordle",
        level: [
            "3/6个约德尔人",
            "对友方约德尔人进行的攻击会有30/55%几率未命中。（也能闪避攻击特效。）"
        ]
    }
];

export const vocation = [{
        label: "刺客",
        en: "cike",
        level: [
            "3/6个刺客",
            "刺客们会额外获得150/350%的暴击伤害。非刺客类英雄的移动会在战斗开始时被减慢"
        ]
    },
    {
        label: "剑士",
        en: "daojiandashi",
        level: ["3/6/9个剑士", "剑士们的每次攻击有45%几率打出1/2/4次额外攻击"]
    },
    {
        label: "斗士",
        en: "jingzheng",
        level: ["2/4个斗士", "斗士获得额外的300/700点最大生命值"]
    },
    {
        label: "元素使",
        en: "yuansu",
        level: [
            "3个元素使",
            "元素使们的攻击提供双倍法力值，在战斗开始时，召唤一个元素魔像。元素生命值：2500"
        ]
    },
    {
        label: "护卫",
        en: "jianhuren",
        level: [
            "2个护卫",
            "在战斗开始时，所有守护者和邻近格子的友军获得50点护甲加成。守护者们不会给自己提供增益"
        ]
    },
    {
        label: "枪手",
        en: "shenqiang",
        level: [
            "2/4/6个枪手",
            "在攻击之后，枪手们的攻击有50%几率对另一名随机/另两名随机/另三名随机敌人打出额外的攻击"
        ]
    },
    {
        label: "骑士",
        en: "qishi",
        level: ["2/4/6个骑士", "整支队伍无视来自所有来源的15/30/55伤害"]
    },
    {
        label: "游侠",
        en: "youxia",
        level: [
            "2/4个游侠",
            "游侠们每过3秒都有25/65%几率来使他们在接下来的3秒内攻速翻倍"
        ]
    },
    {
        label: "换形师",
        en: "bianxing",
        level: ["3/6个换形师", "换形师会在他们变形时获得额外的60/120%最大生命值"]
    },
    {
        label: "法师",
        en: "wushi",
        level: ["3/6个法师", "所有友军增加35/100%技能伤害"]
    }
];